test_postgresql/100000user_10threads.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 10 tps: 1489.76 qps: 29961.76 (r/w/o: 20990.28/5977.99/2993.48) lat (ms,95%): 12.08 err/s: 1.00 reconn/s: 0.00
[ 2s ] thds: 10 tps: 1956.22 qps: 39117.41 (r/w/o: 27393.09/7811.88/3912.44) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 10 tps: 1872.80 qps: 37479.99 (r/w/o: 26231.20/7499.20/3749.60) lat (ms,95%): 8.13 err/s: 2.00 reconn/s: 0.00
[ 4s ] thds: 10 tps: 1919.33 qps: 38390.62 (r/w/o: 26868.63/7681.32/3840.66) lat (ms,95%): 7.70 err/s: 1.00 reconn/s: 0.00
[ 5s ] thds: 10 tps: 1925.05 qps: 38503.08 (r/w/o: 26956.75/7694.22/3852.11) lat (ms,95%): 7.70 err/s: 1.00 reconn/s: 0.00
[ 6s ] thds: 10 tps: 1970.00 qps: 39404.94 (r/w/o: 27576.96/7886.99/3940.99) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 10 tps: 1870.02 qps: 37403.44 (r/w/o: 26190.31/7471.09/3742.04) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 10 tps: 1327.97 qps: 26636.49 (r/w/o: 18654.64/5320.90/2660.95) lat (ms,95%): 8.90 err/s: 3.00 reconn/s: 0.00
[ 9s ] thds: 10 tps: 1661.00 qps: 33213.98 (r/w/o: 23247.99/6644.00/3322.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 10 tps: 1880.96 qps: 37653.26 (r/w/o: 26364.48/7519.85/3768.93) lat (ms,95%): 7.84 err/s: 2.00 reconn/s: 0.00
[ 11s ] thds: 10 tps: 1900.03 qps: 38028.66 (r/w/o: 26612.46/7613.13/3803.07) lat (ms,95%): 7.84 err/s: 1.00 reconn/s: 0.00
[ 12s ] thds: 10 tps: 1924.96 qps: 38484.11 (r/w/o: 26944.38/7688.82/3850.91) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 10 tps: 1911.06 qps: 38249.24 (r/w/o: 26768.87/7656.25/3824.12) lat (ms,95%): 7.84 err/s: 1.00 reconn/s: 0.00
[ 14s ] thds: 10 tps: 1913.96 qps: 38249.10 (r/w/o: 26772.37/7643.82/3832.91) lat (ms,95%): 7.70 err/s: 2.00 reconn/s: 0.00
[ 15s ] thds: 10 tps: 1903.62 qps: 38133.45 (r/w/o: 26704.71/7621.49/3807.25) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 10 tps: 1964.43 qps: 39278.56 (r/w/o: 27490.99/7855.71/3931.86) lat (ms,95%): 7.70 err/s: 1.00 reconn/s: 0.00
[ 17s ] thds: 10 tps: 1938.84 qps: 38778.88 (r/w/o: 27142.81/7757.38/3878.69) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 10 tps: 1960.16 qps: 39195.11 (r/w/o: 27438.18/7835.62/3921.31) lat (ms,95%): 7.56 err/s: 1.00 reconn/s: 0.00
[ 19s ] thds: 10 tps: 1947.05 qps: 38923.90 (r/w/o: 27239.63/7787.18/3897.09) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 10 tps: 1413.97 qps: 28398.46 (r/w/o: 19892.62/5671.89/2833.95) lat (ms,95%): 16.41 err/s: 2.00 reconn/s: 0.00
[ 21s ] thds: 10 tps: 1783.85 qps: 35665.99 (r/w/o: 24967.89/7127.40/3570.70) lat (ms,95%): 8.58 err/s: 1.00 reconn/s: 0.00
[ 22s ] thds: 10 tps: 1964.17 qps: 39293.44 (r/w/o: 27506.41/7852.69/3934.34) lat (ms,95%): 7.70 err/s: 2.00 reconn/s: 0.00
[ 23s ] thds: 10 tps: 1757.90 qps: 35242.03 (r/w/o: 24674.62/7047.61/3519.80) lat (ms,95%): 9.22 err/s: 1.00 reconn/s: 0.00
[ 24s ] thds: 10 tps: 1509.09 qps: 30115.80 (r/w/o: 21075.26/6019.36/3021.18) lat (ms,95%): 9.91 err/s: 1.00 reconn/s: 0.00
[ 25s ] thds: 10 tps: 1860.82 qps: 37263.45 (r/w/o: 26085.52/7451.29/3726.65) lat (ms,95%): 7.98 err/s: 1.00 reconn/s: 0.00
[ 26s ] thds: 10 tps: 1945.14 qps: 38941.78 (r/w/o: 27265.94/7779.55/3896.28) lat (ms,95%): 7.56 err/s: 2.00 reconn/s: 0.00
[ 27s ] thds: 10 tps: 1827.66 qps: 36700.19 (r/w/o: 25686.24/7351.64/3662.32) lat (ms,95%): 8.43 err/s: 3.00 reconn/s: 0.00
[ 28s ] thds: 10 tps: 1664.27 qps: 33270.36 (r/w/o: 23294.75/6647.07/3328.54) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 10 tps: 1928.97 qps: 38557.33 (r/w/o: 27001.53/7691.87/3863.93) lat (ms,95%): 7.84 err/s: 2.00 reconn/s: 0.00
[ 30s ] thds: 10 tps: 1913.13 qps: 38289.57 (r/w/o: 26805.80/7654.51/3829.26) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 10 tps: 1363.87 qps: 27259.38 (r/w/o: 19080.17/5448.48/2730.74) lat (ms,95%): 8.90 err/s: 1.00 reconn/s: 0.00
[ 32s ] thds: 10 tps: 1780.61 qps: 35635.25 (r/w/o: 24945.57/7124.46/3565.22) lat (ms,95%): 8.43 err/s: 1.00 reconn/s: 0.00
[ 33s ] thds: 10 tps: 1529.55 qps: 30635.02 (r/w/o: 21445.72/6121.19/3068.11) lat (ms,95%): 10.65 err/s: 2.00 reconn/s: 0.00
[ 34s ] thds: 10 tps: 1848.38 qps: 37036.68 (r/w/o: 25913.37/7425.54/3697.77) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 10 tps: 1869.97 qps: 37319.32 (r/w/o: 26135.52/7438.86/3744.93) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 10 tps: 1873.25 qps: 37520.08 (r/w/o: 26266.56/7505.02/3748.51) lat (ms,95%): 7.98 err/s: 1.00 reconn/s: 0.00
[ 37s ] thds: 10 tps: 1911.93 qps: 38234.61 (r/w/o: 26766.03/7641.72/3826.86) lat (ms,95%): 7.84 err/s: 1.00 reconn/s: 0.00
[ 38s ] thds: 10 tps: 1848.69 qps: 36960.84 (r/w/o: 25869.69/7393.77/3697.38) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 10 tps: 1953.19 qps: 39109.78 (r/w/o: 27385.65/7809.75/3914.38) lat (ms,95%): 7.70 err/s: 1.00 reconn/s: 0.00
[ 40s ] thds: 10 tps: 1932.00 qps: 38612.01 (r/w/o: 27022.01/7724.00/3866.00) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 10 tps: 1819.12 qps: 36447.17 (r/w/o: 25523.50/7280.45/3643.22) lat (ms,95%): 8.13 err/s: 2.00 reconn/s: 0.00
[ 42s ] thds: 10 tps: 1803.04 qps: 36060.88 (r/w/o: 25234.60/7218.19/3608.09) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 10 tps: 1965.95 qps: 39350.98 (r/w/o: 27557.28/7856.80/3936.90) lat (ms,95%): 7.70 err/s: 2.00 reconn/s: 0.00
[ 44s ] thds: 10 tps: 1951.03 qps: 38996.52 (r/w/o: 27280.36/7810.10/3906.05) lat (ms,95%): 7.84 err/s: 1.00 reconn/s: 0.00
[ 45s ] thds: 10 tps: 1841.02 qps: 36819.33 (r/w/o: 25780.23/7355.07/3684.03) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 46s ] thds: 10 tps: 1885.99 qps: 37749.77 (r/w/o: 26425.84/7549.95/3773.98) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 10 tps: 1942.03 qps: 38899.62 (r/w/o: 27240.43/7770.12/3889.06) lat (ms,95%): 7.70 err/s: 2.00 reconn/s: 0.00
[ 48s ] thds: 10 tps: 1954.99 qps: 39095.78 (r/w/o: 27355.84/7829.96/3909.98) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 10 tps: 1877.94 qps: 37521.83 (r/w/o: 26268.18/7495.77/3757.88) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 10 tps: 1764.51 qps: 35315.10 (r/w/o: 24726.06/7056.03/3533.01) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 10 tps: 1742.42 qps: 34893.55 (r/w/o: 24430.00/6978.71/3484.85) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 10 tps: 1880.92 qps: 37568.36 (r/w/o: 26291.85/7511.67/3764.84) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 10 tps: 1816.12 qps: 36320.35 (r/w/o: 25424.65/7263.47/3632.24) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 10 tps: 1872.92 qps: 37456.45 (r/w/o: 26211.92/7497.69/3746.85) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 10 tps: 1774.02 qps: 35537.43 (r/w/o: 24879.30/7107.09/3551.04) lat (ms,95%): 8.28 err/s: 1.00 reconn/s: 0.00
[ 56s ] thds: 10 tps: 1849.65 qps: 36964.05 (r/w/o: 25875.13/7387.61/3701.30) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 10 tps: 1915.34 qps: 38314.72 (r/w/o: 26826.70/7653.34/3834.67) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 10 tps: 1863.11 qps: 37252.30 (r/w/o: 26072.61/7450.46/3729.23) lat (ms,95%): 7.84 err/s: 1.00 reconn/s: 0.00
[ 59s ] thds: 10 tps: 1753.83 qps: 35066.59 (r/w/o: 24547.61/7009.32/3509.66) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 10 tps: 1776.20 qps: 35586.05 (r/w/o: 24920.84/7110.81/3554.40) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 10 tps: 1847.95 qps: 36891.03 (r/w/o: 25809.32/7384.81/3696.90) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 10 tps: 1899.46 qps: 38101.04 (r/w/o: 26666.34/7635.78/3798.92) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 10 tps: 1848.18 qps: 36896.52 (r/w/o: 25843.49/7353.66/3699.37) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 64s ] thds: 10 tps: 1928.93 qps: 38583.56 (r/w/o: 27002.99/7721.71/3858.86) lat (ms,95%): 7.70 err/s: 1.00 reconn/s: 0.00
[ 65s ] thds: 10 tps: 1913.59 qps: 38339.60 (r/w/o: 26848.10/7658.34/3833.16) lat (ms,95%): 7.84 err/s: 1.00 reconn/s: 0.00
[ 66s ] thds: 10 tps: 1862.64 qps: 37262.76 (r/w/o: 26083.93/7449.55/3729.28) lat (ms,95%): 7.84 err/s: 2.00 reconn/s: 0.00
[ 67s ] thds: 10 tps: 1892.96 qps: 37858.19 (r/w/o: 26497.43/7573.84/3786.92) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 10 tps: 1843.61 qps: 36934.14 (r/w/o: 25865.48/7375.45/3693.21) lat (ms,95%): 8.28 err/s: 2.00 reconn/s: 0.00
[ 69s ] thds: 10 tps: 1733.05 qps: 34660.07 (r/w/o: 24261.75/6929.21/3469.11) lat (ms,95%): 8.43 err/s: 1.00 reconn/s: 0.00
[ 70s ] thds: 10 tps: 1766.81 qps: 35355.26 (r/w/o: 24747.38/7069.25/3538.63) lat (ms,95%): 8.43 err/s: 1.00 reconn/s: 0.00
[ 71s ] thds: 10 tps: 1840.46 qps: 36816.26 (r/w/o: 25765.48/7367.85/3682.93) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 10 tps: 1837.71 qps: 36765.28 (r/w/o: 25740.00/7343.86/3681.43) lat (ms,95%): 8.90 err/s: 1.00 reconn/s: 0.00
[ 73s ] thds: 10 tps: 1862.18 qps: 37278.55 (r/w/o: 26087.48/7464.71/3726.35) lat (ms,95%): 8.43 err/s: 1.00 reconn/s: 0.00
[ 74s ] thds: 10 tps: 1670.06 qps: 33390.14 (r/w/o: 23384.80/6664.23/3341.11) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 10 tps: 1785.90 qps: 35705.95 (r/w/o: 24985.56/7145.59/3574.79) lat (ms,95%): 9.06 err/s: 1.00 reconn/s: 0.00
[ 76s ] thds: 10 tps: 1812.92 qps: 36287.35 (r/w/o: 25413.85/7245.67/3627.84) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 77s ] thds: 10 tps: 1882.22 qps: 37683.36 (r/w/o: 26378.05/7534.87/3770.44) lat (ms,95%): 8.13 err/s: 2.00 reconn/s: 0.00
[ 78s ] thds: 10 tps: 1822.84 qps: 36511.83 (r/w/o: 25562.78/7297.37/3651.68) lat (ms,95%): 8.13 err/s: 3.00 reconn/s: 0.00
[ 79s ] thds: 10 tps: 1687.00 qps: 33737.98 (r/w/o: 23610.99/6751.00/3376.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 10 tps: 1797.14 qps: 35979.80 (r/w/o: 25192.96/7187.56/3599.28) lat (ms,95%): 8.28 err/s: 1.00 reconn/s: 0.00
[ 81s ] thds: 10 tps: 1851.77 qps: 37035.46 (r/w/o: 25919.82/7411.09/3704.55) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 82s ] thds: 10 tps: 1892.88 qps: 37854.61 (r/w/o: 26505.33/7561.52/3787.76) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 10 tps: 1718.33 qps: 34369.66 (r/w/o: 24059.66/6870.33/3439.67) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 10 tps: 1677.07 qps: 33540.39 (r/w/o: 23469.97/6714.28/3356.14) lat (ms,95%): 9.56 err/s: 1.00 reconn/s: 0.00
[ 85s ] thds: 10 tps: 1726.89 qps: 34554.77 (r/w/o: 24193.44/6905.55/3455.78) lat (ms,95%): 9.73 err/s: 1.00 reconn/s: 0.00
[ 86s ] thds: 10 tps: 1876.02 qps: 37582.37 (r/w/o: 26315.26/7512.07/3755.04) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 10 tps: 1883.95 qps: 37701.96 (r/w/o: 26391.28/7537.79/3772.90) lat (ms,95%): 7.98 err/s: 2.00 reconn/s: 0.00
[ 88s ] thds: 10 tps: 1802.04 qps: 36016.85 (r/w/o: 25205.59/7203.17/3608.09) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 10 tps: 1884.94 qps: 37717.89 (r/w/o: 26406.22/7541.78/3769.89) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 10 tps: 1882.71 qps: 37586.24 (r/w/o: 26302.97/7516.85/3766.42) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 10 tps: 1786.29 qps: 35720.82 (r/w/o: 24998.07/7149.16/3573.58) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 10 tps: 1836.02 qps: 36802.48 (r/w/o: 25777.33/7350.10/3675.05) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 10 tps: 1817.03 qps: 36329.52 (r/w/o: 25436.36/7257.10/3636.05) lat (ms,95%): 8.43 err/s: 1.00 reconn/s: 0.00
[ 94s ] thds: 10 tps: 1892.00 qps: 37844.04 (r/w/o: 26481.03/7577.01/3786.00) lat (ms,95%): 7.98 err/s: 1.00 reconn/s: 0.00
[ 95s ] thds: 10 tps: 1797.01 qps: 35964.21 (r/w/o: 25186.15/7178.04/3600.02) lat (ms,95%): 8.58 err/s: 1.00 reconn/s: 0.00
[ 96s ] thds: 10 tps: 1704.00 qps: 34105.01 (r/w/o: 23874.00/6820.00/3411.00) lat (ms,95%): 9.39 err/s: 1.00 reconn/s: 0.00
[ 97s ] thds: 10 tps: 1849.97 qps: 37039.45 (r/w/o: 25922.61/7408.89/3707.94) lat (ms,95%): 8.13 err/s: 2.00 reconn/s: 0.00
[ 98s ] thds: 10 tps: 1863.86 qps: 37252.28 (r/w/o: 26073.09/7450.46/3728.73) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 10 tps: 1799.17 qps: 36043.37 (r/w/o: 25248.36/7191.67/3603.34) lat (ms,95%): 8.58 err/s: 2.00 reconn/s: 0.00
[ 100s ] thds: 10 tps: 1818.00 qps: 36374.97 (r/w/o: 25462.98/7274.99/3637.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 10 tps: 1851.87 qps: 37003.39 (r/w/o: 25888.17/7408.48/3706.74) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 10 tps: 1936.08 qps: 38711.62 (r/w/o: 27100.13/7739.32/3872.16) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 10 tps: 1886.03 qps: 37782.59 (r/w/o: 26456.42/7549.12/3777.06) lat (ms,95%): 7.98 err/s: 1.00 reconn/s: 0.00
[ 104s ] thds: 10 tps: 1825.02 qps: 36488.42 (r/w/o: 25537.29/7301.08/3650.04) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 105s ] thds: 10 tps: 1817.97 qps: 36428.49 (r/w/o: 25502.65/7283.90/3641.95) lat (ms,95%): 8.28 err/s: 2.00 reconn/s: 0.00
[ 106s ] thds: 10 tps: 1729.00 qps: 34593.06 (r/w/o: 24218.04/6912.01/3463.01) lat (ms,95%): 9.39 err/s: 1.00 reconn/s: 0.00
[ 107s ] thds: 10 tps: 1501.01 qps: 30002.29 (r/w/o: 21001.21/5995.06/3006.03) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 10 tps: 1797.98 qps: 35969.61 (r/w/o: 25177.73/7190.92/3600.96) lat (ms,95%): 8.58 err/s: 2.00 reconn/s: 0.00
[ 109s ] thds: 10 tps: 1900.02 qps: 38053.45 (r/w/o: 26633.32/7614.09/3806.05) lat (ms,95%): 7.84 err/s: 2.00 reconn/s: 0.00
[ 110s ] thds: 10 tps: 1732.11 qps: 34642.23 (r/w/o: 24259.54/6916.47/3466.22) lat (ms,95%): 8.58 err/s: 1.00 reconn/s: 0.00
[ 111s ] thds: 10 tps: 1704.06 qps: 34103.26 (r/w/o: 23875.89/6818.25/3409.12) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 10 tps: 1864.82 qps: 37304.47 (r/w/o: 26112.53/7462.30/3729.65) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 10 tps: 1869.68 qps: 37367.60 (r/w/o: 26155.52/7471.72/3740.36) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 10 tps: 1835.32 qps: 36746.36 (r/w/o: 25725.45/7351.27/3669.63) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 10 tps: 1636.76 qps: 32682.13 (r/w/o: 22868.60/6538.03/3275.51) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 10 tps: 1745.22 qps: 34931.38 (r/w/o: 24460.07/6977.87/3493.44) lat (ms,95%): 8.43 err/s: 1.00 reconn/s: 0.00
[ 117s ] thds: 10 tps: 1864.00 qps: 37357.08 (r/w/o: 26155.06/7470.02/3732.01) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 118s ] thds: 10 tps: 1780.51 qps: 35624.23 (r/w/o: 24942.16/7116.05/3566.02) lat (ms,95%): 8.13 err/s: 2.00 reconn/s: 0.00
[ 119s ] thds: 10 tps: 1706.50 qps: 34114.94 (r/w/o: 23871.95/6828.99/3413.99) lat (ms,95%): 8.90 err/s: 1.00 reconn/s: 0.00
[ 120s ] thds: 10 tps: 1847.98 qps: 36954.52 (r/w/o: 25864.66/7391.90/3697.95) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 121s ] thds: 10 tps: 1846.04 qps: 36957.77 (r/w/o: 25877.54/7385.15/3695.08) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 122s ] thds: 10 tps: 1915.65 qps: 38282.95 (r/w/o: 26796.06/7652.59/3834.29) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 123s ] thds: 10 tps: 1900.29 qps: 38015.87 (r/w/o: 26610.11/7603.17/3802.59) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 124s ] thds: 10 tps: 1844.26 qps: 36902.09 (r/w/o: 25832.56/7377.02/3692.51) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 10 tps: 1905.82 qps: 38124.41 (r/w/o: 26691.49/7620.28/3812.64) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 126s ] thds: 10 tps: 1927.99 qps: 38565.83 (r/w/o: 26999.88/7706.97/3858.98) lat (ms,95%): 7.84 err/s: 1.00 reconn/s: 0.00
[ 127s ] thds: 10 tps: 1876.01 qps: 37569.19 (r/w/o: 26297.13/7513.04/3759.02) lat (ms,95%): 7.98 err/s: 3.00 reconn/s: 0.00
[ 128s ] thds: 10 tps: 1873.90 qps: 37520.08 (r/w/o: 26276.65/7490.62/3752.81) lat (ms,95%): 7.98 err/s: 1.00 reconn/s: 0.00
[ 129s ] thds: 10 tps: 1616.48 qps: 32355.58 (r/w/o: 22647.70/6468.92/3238.95) lat (ms,95%): 11.04 err/s: 2.00 reconn/s: 0.00
[ 130s ] thds: 10 tps: 1616.54 qps: 32343.88 (r/w/o: 22645.61/6464.18/3234.09) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 131s ] thds: 10 tps: 1852.42 qps: 37053.32 (r/w/o: 25928.81/7417.68/3706.83) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 132s ] thds: 10 tps: 1883.94 qps: 37702.76 (r/w/o: 26398.13/7530.75/3773.88) lat (ms,95%): 7.98 err/s: 2.00 reconn/s: 0.00
[ 133s ] thds: 10 tps: 1753.14 qps: 35067.80 (r/w/o: 24542.96/7018.56/3506.28) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 134s ] thds: 10 tps: 1847.01 qps: 36944.23 (r/w/o: 25864.16/7382.05/3698.02) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 10 tps: 1780.50 qps: 35605.09 (r/w/o: 24925.06/7118.02/3562.01) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 136s ] thds: 10 tps: 1752.49 qps: 35074.78 (r/w/o: 24550.85/7016.96/3506.98) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 137s ] thds: 10 tps: 1801.95 qps: 36071.97 (r/w/o: 25255.28/7207.79/3608.90) lat (ms,95%): 8.43 err/s: 2.00 reconn/s: 0.00
[ 138s ] thds: 10 tps: 1913.92 qps: 38245.43 (r/w/o: 26760.90/7650.69/3833.84) lat (ms,95%): 7.98 err/s: 1.00 reconn/s: 0.00
[ 139s ] thds: 10 tps: 1941.58 qps: 38859.49 (r/w/o: 27214.04/7762.30/3883.15) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 10 tps: 1728.39 qps: 34598.76 (r/w/o: 24212.43/6926.55/3459.78) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 141s ] thds: 10 tps: 1694.09 qps: 33889.74 (r/w/o: 23722.22/6774.35/3393.17) lat (ms,95%): 10.46 err/s: 1.00 reconn/s: 0.00
[ 142s ] thds: 10 tps: 1891.46 qps: 37797.26 (r/w/o: 26458.48/7555.85/3782.92) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 143s ] thds: 10 tps: 1890.86 qps: 37801.20 (r/w/o: 26461.04/7559.44/3780.72) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 144s ] thds: 10 tps: 1759.45 qps: 35242.06 (r/w/o: 24680.36/7036.79/3524.91) lat (ms,95%): 8.74 err/s: 2.00 reconn/s: 0.00
[ 145s ] thds: 10 tps: 1837.75 qps: 36805.97 (r/w/o: 25769.48/7358.00/3678.50) lat (ms,95%): 8.28 err/s: 1.00 reconn/s: 0.00
[ 146s ] thds: 10 tps: 1855.79 qps: 37184.84 (r/w/o: 26012.09/7455.17/3717.58) lat (ms,95%): 8.43 err/s: 1.00 reconn/s: 0.00
[ 147s ] thds: 10 tps: 1709.44 qps: 34141.82 (r/w/o: 23912.18/6810.76/3418.88) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 148s ] thds: 10 tps: 1898.96 qps: 37990.28 (r/w/o: 26595.49/7593.86/3800.93) lat (ms,95%): 8.28 err/s: 1.00 reconn/s: 0.00
[ 149s ] thds: 10 tps: 1908.91 qps: 38166.26 (r/w/o: 26712.78/7633.65/3819.83) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 10 tps: 1885.74 qps: 37770.87 (r/w/o: 26449.41/7541.98/3779.49) lat (ms,95%): 8.28 err/s: 4.00 reconn/s: 0.00
[ 151s ] thds: 10 tps: 1717.05 qps: 34321.08 (r/w/o: 24015.77/6869.21/3436.10) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 152s ] thds: 10 tps: 1783.02 qps: 35655.43 (r/w/o: 24958.30/7131.09/3566.04) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 153s ] thds: 10 tps: 1743.17 qps: 34904.39 (r/w/o: 24440.38/6975.67/3488.33) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 154s ] thds: 10 tps: 1826.05 qps: 36496.98 (r/w/o: 25540.69/7302.20/3654.10) lat (ms,95%): 8.58 err/s: 1.00 reconn/s: 0.00
[ 155s ] thds: 10 tps: 1794.09 qps: 35904.79 (r/w/o: 25136.25/7179.36/3589.18) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 156s ] thds: 10 tps: 1847.01 qps: 36956.24 (r/w/o: 25874.16/7388.05/3694.02) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 157s ] thds: 10 tps: 1850.97 qps: 36972.37 (r/w/o: 25867.56/7401.87/3702.94) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 158s ] thds: 10 tps: 1825.97 qps: 36519.40 (r/w/o: 25572.58/7294.88/3651.94) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 159s ] thds: 10 tps: 1794.12 qps: 35956.31 (r/w/o: 25173.61/7184.46/3598.23) lat (ms,95%): 8.43 err/s: 2.00 reconn/s: 0.00
[ 160s ] thds: 10 tps: 1780.81 qps: 35579.11 (r/w/o: 24899.27/7114.22/3565.61) lat (ms,95%): 8.74 err/s: 1.00 reconn/s: 0.00
[ 161s ] thds: 10 tps: 1802.13 qps: 36116.62 (r/w/o: 25293.84/7216.52/3606.26) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 162s ] thds: 10 tps: 1614.29 qps: 32222.81 (r/w/o: 22547.07/6447.16/3228.58) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 163s ] thds: 10 tps: 1472.63 qps: 29557.57 (r/w/o: 20697.80/5907.51/2952.26) lat (ms,95%): 13.95 err/s: 2.00 reconn/s: 0.00
[ 164s ] thds: 10 tps: 1780.90 qps: 35587.99 (r/w/o: 24907.59/7116.60/3563.80) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 10 tps: 1829.12 qps: 36550.37 (r/w/o: 25579.66/7314.47/3656.24) lat (ms,95%): 8.58 err/s: 1.00 reconn/s: 0.00
[ 166s ] thds: 10 tps: 1885.72 qps: 37779.41 (r/w/o: 26457.09/7544.88/3777.44) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 167s ] thds: 10 tps: 1905.26 qps: 38126.24 (r/w/o: 26684.67/7628.05/3813.52) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 168s ] thds: 10 tps: 1849.99 qps: 37015.75 (r/w/o: 25908.83/7406.95/3699.98) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 169s ] thds: 10 tps: 1918.92 qps: 38329.33 (r/w/o: 26838.83/7650.67/3839.83) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 10 tps: 1820.12 qps: 36455.40 (r/w/o: 25513.68/7295.48/3646.24) lat (ms,95%): 8.58 err/s: 2.00 reconn/s: 0.00
[ 171s ] thds: 10 tps: 1763.55 qps: 35298.08 (r/w/o: 24714.75/7052.22/3531.11) lat (ms,95%): 9.91 err/s: 2.00 reconn/s: 0.00
[ 172s ] thds: 10 tps: 1924.38 qps: 38458.57 (r/w/o: 26919.30/7689.51/3849.76) lat (ms,95%): 7.98 err/s: 1.00 reconn/s: 0.00
[ 173s ] thds: 10 tps: 1724.57 qps: 34552.40 (r/w/o: 24195.98/6902.28/3454.14) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 174s ] thds: 10 tps: 1737.66 qps: 34729.27 (r/w/o: 24299.29/6953.65/3476.33) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 10 tps: 1499.73 qps: 29978.53 (r/w/o: 20989.17/5985.90/3003.46) lat (ms,95%): 12.30 err/s: 1.00 reconn/s: 0.00
[ 176s ] thds: 10 tps: 1711.97 qps: 34314.41 (r/w/o: 24024.59/6859.88/3429.94) lat (ms,95%): 8.58 err/s: 1.00 reconn/s: 0.00
[ 177s ] thds: 10 tps: 1677.98 qps: 33531.70 (r/w/o: 23472.79/6702.94/3355.97) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 178s ] thds: 10 tps: 1890.06 qps: 37830.14 (r/w/o: 26483.80/7566.23/3780.11) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 179s ] thds: 10 tps: 1763.93 qps: 35244.54 (r/w/o: 24663.98/7046.71/3533.85) lat (ms,95%): 11.45 err/s: 1.00 reconn/s: 0.00
[ 180s ] thds: 10 tps: 1875.09 qps: 37528.86 (r/w/o: 26274.30/7502.37/3752.19) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 181s ] thds: 10 tps: 1731.89 qps: 34660.81 (r/w/o: 24266.47/6931.56/3462.78) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 182s ] thds: 10 tps: 1875.10 qps: 37461.01 (r/w/o: 26221.41/7488.40/3751.20) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 183s ] thds: 10 tps: 1796.99 qps: 35981.73 (r/w/o: 25191.81/7193.95/3595.97) lat (ms,95%): 8.43 err/s: 1.00 reconn/s: 0.00
[ 184s ] thds: 10 tps: 1852.74 qps: 37070.72 (r/w/o: 25951.30/7409.94/3709.47) lat (ms,95%): 8.28 err/s: 2.00 reconn/s: 0.00
[ 185s ] thds: 10 tps: 1689.26 qps: 33848.18 (r/w/o: 23696.62/6767.04/3384.52) lat (ms,95%): 9.39 err/s: 2.00 reconn/s: 0.00
[ 186s ] thds: 10 tps: 1662.88 qps: 33237.60 (r/w/o: 23267.32/6644.52/3325.76) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 187s ] thds: 10 tps: 1796.08 qps: 35956.58 (r/w/o: 25168.11/7196.32/3592.16) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 188s ] thds: 10 tps: 1862.03 qps: 37272.53 (r/w/o: 26097.37/7447.11/3728.05) lat (ms,95%): 8.28 err/s: 2.00 reconn/s: 0.00
[ 189s ] thds: 10 tps: 1821.89 qps: 36416.70 (r/w/o: 25490.39/7283.54/3642.77) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 10 tps: 1838.13 qps: 36781.57 (r/w/o: 25747.80/7354.51/3679.26) lat (ms,95%): 8.58 err/s: 1.00 reconn/s: 0.00
[ 191s ] thds: 10 tps: 1821.85 qps: 36434.98 (r/w/o: 25502.89/7288.40/3643.70) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 192s ] thds: 10 tps: 1833.13 qps: 36682.62 (r/w/o: 25680.83/7333.52/3668.26) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 193s ] thds: 10 tps: 1844.77 qps: 36948.47 (r/w/o: 25866.83/7385.09/3696.55) lat (ms,95%): 8.13 err/s: 3.00 reconn/s: 0.00
[ 194s ] thds: 10 tps: 1864.23 qps: 37328.60 (r/w/o: 26132.22/7460.92/3735.46) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 195s ] thds: 10 tps: 1790.03 qps: 35783.51 (r/w/o: 25049.36/7154.10/3580.05) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 196s ] thds: 10 tps: 1858.01 qps: 37154.25 (r/w/o: 26002.18/7434.05/3718.03) lat (ms,95%): 8.28 err/s: 1.00 reconn/s: 0.00
[ 197s ] thds: 10 tps: 1896.75 qps: 37987.90 (r/w/o: 26600.43/7588.98/3798.49) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 198s ] thds: 10 tps: 1887.27 qps: 37755.31 (r/w/o: 26418.71/7558.06/3778.53) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 199s ] thds: 10 tps: 1441.97 qps: 28882.43 (r/w/o: 20237.60/5755.89/2888.94) lat (ms,95%): 16.71 err/s: 1.00 reconn/s: 0.00
[ 200s ] thds: 10 tps: 1710.99 qps: 34169.84 (r/w/o: 23904.89/6842.97/3421.98) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 201s ] thds: 10 tps: 1686.90 qps: 33795.98 (r/w/o: 23658.59/6756.60/3380.80) lat (ms,95%): 9.56 err/s: 1.00 reconn/s: 0.00
[ 202s ] thds: 10 tps: 1801.00 qps: 36068.92 (r/w/o: 25243.94/7222.98/3601.99) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 203s ] thds: 10 tps: 1897.14 qps: 37888.83 (r/w/o: 26525.98/7563.56/3799.28) lat (ms,95%): 7.98 err/s: 1.00 reconn/s: 0.00
[ 204s ] thds: 10 tps: 1859.00 qps: 37177.08 (r/w/o: 26025.06/7430.02/3722.01) lat (ms,95%): 7.98 err/s: 1.00 reconn/s: 0.00
[ 205s ] thds: 10 tps: 1587.81 qps: 31762.25 (r/w/o: 22242.36/6343.27/3176.62) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 206s ] thds: 10 tps: 1631.24 qps: 32664.88 (r/w/o: 22862.41/6535.98/3266.49) lat (ms,95%): 10.46 err/s: 1.00 reconn/s: 0.00
[ 207s ] thds: 10 tps: 1740.04 qps: 34797.78 (r/w/o: 24367.55/6949.16/3481.08) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 208s ] thds: 10 tps: 1817.69 qps: 36392.77 (r/w/o: 25473.64/7278.75/3640.38) lat (ms,95%): 8.58 err/s: 1.00 reconn/s: 0.00
[ 209s ] thds: 10 tps: 1901.11 qps: 37994.11 (r/w/o: 26584.48/7604.42/3805.21) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 210s ] thds: 10 tps: 1871.13 qps: 37457.60 (r/w/o: 26231.82/7479.52/3746.26) lat (ms,95%): 8.28 err/s: 1.00 reconn/s: 0.00
[ 211s ] thds: 10 tps: 1780.07 qps: 35603.37 (r/w/o: 24917.96/7125.27/3560.14) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 212s ] thds: 10 tps: 1872.45 qps: 37492.91 (r/w/o: 26251.23/7493.79/3747.89) lat (ms,95%): 8.28 err/s: 1.00 reconn/s: 0.00
[ 213s ] thds: 10 tps: 1808.72 qps: 36167.36 (r/w/o: 25316.05/7231.87/3619.44) lat (ms,95%): 8.43 err/s: 1.00 reconn/s: 0.00
[ 214s ] thds: 10 tps: 1881.70 qps: 37661.11 (r/w/o: 26369.88/7524.81/3766.41) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 215s ] thds: 10 tps: 1792.69 qps: 35864.88 (r/w/o: 25100.72/7172.78/3591.39) lat (ms,95%): 8.74 err/s: 1.00 reconn/s: 0.00
[ 216s ] thds: 10 tps: 1548.40 qps: 30963.09 (r/w/o: 21671.67/6192.62/3098.80) lat (ms,95%): 11.04 err/s: 1.00 reconn/s: 0.00
[ 217s ] thds: 10 tps: 1786.13 qps: 35711.51 (r/w/o: 24999.76/7139.50/3572.25) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 218s ] thds: 10 tps: 1927.28 qps: 38561.54 (r/w/o: 26992.88/7710.11/3858.55) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 219s ] thds: 10 tps: 1750.92 qps: 35051.30 (r/w/o: 24532.81/7012.66/3505.83) lat (ms,95%): 11.04 err/s: 1.00 reconn/s: 0.00
[ 220s ] thds: 10 tps: 1814.91 qps: 36376.28 (r/w/o: 25459.79/7285.65/3630.83) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 221s ] thds: 10 tps: 1124.11 qps: 22482.13 (r/w/o: 15737.49/4495.43/2249.21) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 222s ] thds: 10 tps: 1715.95 qps: 34243.95 (r/w/o: 23981.27/6828.79/3433.89) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 223s ] thds: 10 tps: 1827.03 qps: 36552.51 (r/w/o: 25584.36/7306.10/3662.05) lat (ms,95%): 9.22 err/s: 4.00 reconn/s: 0.00
[ 224s ] thds: 10 tps: 1870.03 qps: 37471.61 (r/w/o: 26237.43/7487.12/3747.06) lat (ms,95%): 7.98 err/s: 1.00 reconn/s: 0.00
[ 225s ] thds: 10 tps: 1702.25 qps: 34075.06 (r/w/o: 23848.54/6817.01/3409.50) lat (ms,95%): 9.22 err/s: 1.00 reconn/s: 0.00
[ 226s ] thds: 10 tps: 1809.78 qps: 36194.68 (r/w/o: 25346.98/7223.13/3624.57) lat (ms,95%): 8.28 err/s: 1.00 reconn/s: 0.00
[ 227s ] thds: 10 tps: 1646.00 qps: 32949.00 (r/w/o: 23071.00/6582.00/3296.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 228s ] thds: 10 tps: 1736.02 qps: 34740.50 (r/w/o: 24307.35/6959.10/3474.05) lat (ms,95%): 9.22 err/s: 1.00 reconn/s: 0.00
[ 229s ] thds: 10 tps: 1891.69 qps: 37805.75 (r/w/o: 26461.62/7558.75/3785.37) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 10 tps: 1785.27 qps: 35740.40 (r/w/o: 25025.78/7139.08/3575.54) lat (ms,95%): 8.43 err/s: 1.00 reconn/s: 0.00
[ 231s ] thds: 10 tps: 1842.66 qps: 36834.28 (r/w/o: 25779.30/7367.66/3687.33) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 232s ] thds: 10 tps: 1887.37 qps: 37778.34 (r/w/o: 26445.14/7558.47/3774.73) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 233s ] thds: 10 tps: 1899.99 qps: 38032.84 (r/w/o: 26625.89/7605.97/3800.98) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 234s ] thds: 10 tps: 1851.92 qps: 37022.42 (r/w/o: 25922.90/7388.69/3710.84) lat (ms,95%): 7.98 err/s: 2.00 reconn/s: 0.00
[ 235s ] thds: 10 tps: 1722.09 qps: 34498.79 (r/w/o: 24147.25/6898.36/3453.18) lat (ms,95%): 8.43 err/s: 3.00 reconn/s: 0.00
[ 236s ] thds: 10 tps: 1869.91 qps: 37423.13 (r/w/o: 26199.69/7479.63/3743.81) lat (ms,95%): 7.98 err/s: 1.00 reconn/s: 0.00
[ 237s ] thds: 10 tps: 1767.51 qps: 35359.14 (r/w/o: 24756.10/7066.03/3537.01) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 238s ] thds: 10 tps: 1695.81 qps: 33938.21 (r/w/o: 23760.35/6782.24/3395.62) lat (ms,95%): 9.06 err/s: 2.00 reconn/s: 0.00
[ 239s ] thds: 10 tps: 1916.81 qps: 38357.18 (r/w/o: 26855.33/7665.23/3836.62) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 10 tps: 1873.58 qps: 37510.69 (r/w/o: 26262.18/7494.34/3754.17) lat (ms,95%): 8.13 err/s: 2.00 reconn/s: 0.00
[ 241s ] thds: 10 tps: 1839.42 qps: 36828.36 (r/w/o: 25772.85/7373.67/3681.84) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 242s ] thds: 10 tps: 1903.00 qps: 38051.97 (r/w/o: 26635.98/7607.99/3808.00) lat (ms,95%): 7.84 err/s: 1.00 reconn/s: 0.00
[ 243s ] thds: 10 tps: 1910.95 qps: 38184.09 (r/w/o: 26721.36/7639.82/3822.91) lat (ms,95%): 7.70 err/s: 1.00 reconn/s: 0.00
[ 244s ] thds: 10 tps: 1807.04 qps: 36141.76 (r/w/o: 25304.54/7224.15/3613.08) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 10 tps: 1876.87 qps: 37580.31 (r/w/o: 26310.12/7511.46/3758.73) lat (ms,95%): 7.98 err/s: 1.00 reconn/s: 0.00
[ 246s ] thds: 10 tps: 1931.09 qps: 38670.86 (r/w/o: 27078.30/7725.37/3867.19) lat (ms,95%): 7.70 err/s: 1.00 reconn/s: 0.00
[ 247s ] thds: 10 tps: 1901.93 qps: 38096.58 (r/w/o: 26668.01/7618.72/3809.86) lat (ms,95%): 7.70 err/s: 3.00 reconn/s: 0.00
[ 248s ] thds: 10 tps: 1785.55 qps: 35724.88 (r/w/o: 25013.61/7137.19/3574.09) lat (ms,95%): 9.06 err/s: 1.00 reconn/s: 0.00
[ 249s ] thds: 10 tps: 1621.21 qps: 32443.26 (r/w/o: 22704.97/6492.86/3245.43) lat (ms,95%): 11.45 err/s: 1.00 reconn/s: 0.00
[ 250s ] thds: 10 tps: 1809.00 qps: 36162.04 (r/w/o: 25318.03/7224.01/3620.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 251s ] thds: 10 tps: 1782.05 qps: 35655.02 (r/w/o: 24950.71/7140.20/3564.10) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 252s ] thds: 10 tps: 1796.97 qps: 35924.38 (r/w/o: 25140.57/7184.88/3598.94) lat (ms,95%): 8.28 err/s: 2.00 reconn/s: 0.00
[ 253s ] thds: 10 tps: 1845.34 qps: 36970.82 (r/w/o: 25892.76/7387.37/3690.69) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 254s ] thds: 10 tps: 1869.71 qps: 37382.18 (r/w/o: 26170.93/7469.83/3741.42) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 10 tps: 1897.98 qps: 37906.58 (r/w/o: 26522.70/7585.92/3797.96) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 256s ] thds: 10 tps: 1844.94 qps: 36954.72 (r/w/o: 25868.11/7395.74/3690.87) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 257s ] thds: 10 tps: 1766.07 qps: 35406.35 (r/w/o: 24798.94/7067.27/3540.13) lat (ms,95%): 7.70 err/s: 3.00 reconn/s: 0.00
[ 258s ] thds: 10 tps: 1793.00 qps: 35780.92 (r/w/o: 25040.95/7152.98/3586.99) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 259s ] thds: 10 tps: 1778.86 qps: 35606.24 (r/w/o: 24923.07/7123.45/3559.72) lat (ms,95%): 7.43 err/s: 1.00 reconn/s: 0.00
[ 260s ] thds: 10 tps: 1557.19 qps: 31182.75 (r/w/o: 21830.62/6232.76/3119.37) lat (ms,95%): 9.91 err/s: 2.00 reconn/s: 0.00
[ 261s ] thds: 10 tps: 1384.52 qps: 27726.54 (r/w/o: 19416.39/5539.10/2771.05) lat (ms,95%): 11.04 err/s: 1.00 reconn/s: 0.00
[ 262s ] thds: 10 tps: 1762.94 qps: 35248.74 (r/w/o: 24671.12/7050.75/3526.87) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 263s ] thds: 10 tps: 1837.14 qps: 36715.84 (r/w/o: 25694.98/7345.57/3675.28) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 264s ] thds: 10 tps: 1909.69 qps: 38250.87 (r/w/o: 26791.71/7638.78/3820.39) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 10 tps: 1847.65 qps: 36959.06 (r/w/o: 25866.15/7394.61/3698.30) lat (ms,95%): 7.98 err/s: 2.00 reconn/s: 0.00
[ 266s ] thds: 10 tps: 1783.78 qps: 35686.63 (r/w/o: 24980.94/7136.12/3569.56) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 267s ] thds: 10 tps: 1899.08 qps: 38010.66 (r/w/o: 26613.16/7598.33/3799.17) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 268s ] thds: 10 tps: 1864.72 qps: 37288.39 (r/w/o: 26102.08/7455.88/3730.44) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 269s ] thds: 10 tps: 1719.30 qps: 34356.03 (r/w/o: 24037.23/6879.20/3439.60) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 10 tps: 1815.72 qps: 36414.54 (r/w/o: 25490.18/7288.91/3635.45) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 271s ] thds: 10 tps: 1703.06 qps: 33966.18 (r/w/o: 23783.82/6775.23/3407.12) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 272s ] thds: 10 tps: 1663.67 qps: 33312.24 (r/w/o: 23325.25/6657.66/3329.33) lat (ms,95%): 9.22 err/s: 1.00 reconn/s: 0.00
[ 273s ] thds: 10 tps: 1810.57 qps: 36199.44 (r/w/o: 25330.99/7246.30/3622.15) lat (ms,95%): 8.28 err/s: 1.00 reconn/s: 0.00
[ 274s ] thds: 10 tps: 1868.03 qps: 37365.55 (r/w/o: 26152.39/7475.11/3738.06) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 10 tps: 1887.89 qps: 37788.78 (r/w/o: 26450.45/7558.56/3779.78) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 276s ] thds: 10 tps: 1888.14 qps: 37818.76 (r/w/o: 26487.93/7550.55/3780.28) lat (ms,95%): 7.84 err/s: 2.00 reconn/s: 0.00
[ 277s ] thds: 10 tps: 1809.99 qps: 36227.87 (r/w/o: 25363.91/7240.97/3622.99) lat (ms,95%): 8.74 err/s: 1.00 reconn/s: 0.00
[ 278s ] thds: 10 tps: 1756.96 qps: 35117.13 (r/w/o: 24571.39/7027.83/3517.91) lat (ms,95%): 9.73 err/s: 1.00 reconn/s: 0.00
[ 279s ] thds: 10 tps: 1810.02 qps: 36238.40 (r/w/o: 25371.28/7242.08/3625.04) lat (ms,95%): 8.74 err/s: 2.00 reconn/s: 0.00
[ 280s ] thds: 10 tps: 1895.00 qps: 37941.01 (r/w/o: 26570.01/7578.00/3793.00) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 281s ] thds: 10 tps: 1835.05 qps: 36717.94 (r/w/o: 25697.66/7346.19/3674.09) lat (ms,95%): 7.98 err/s: 2.00 reconn/s: 0.00
[ 282s ] thds: 10 tps: 1829.54 qps: 36679.59 (r/w/o: 25672.42/7347.10/3660.07) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 283s ] thds: 10 tps: 1560.53 qps: 31144.47 (r/w/o: 21803.33/6220.08/3121.06) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 284s ] thds: 10 tps: 1761.06 qps: 35247.14 (r/w/o: 24686.80/7031.23/3529.11) lat (ms,95%): 9.39 err/s: 2.00 reconn/s: 0.00
[ 285s ] thds: 10 tps: 1751.32 qps: 35044.31 (r/w/o: 24523.42/7017.26/3503.63) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 286s ] thds: 10 tps: 1889.13 qps: 37784.60 (r/w/o: 26458.82/7543.52/3782.26) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 287s ] thds: 10 tps: 1854.32 qps: 37102.39 (r/w/o: 25963.47/7426.28/3712.64) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 288s ] thds: 10 tps: 1793.66 qps: 35890.24 (r/w/o: 25127.27/7172.65/3590.32) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 289s ] thds: 10 tps: 1770.96 qps: 35440.24 (r/w/o: 24812.47/7085.85/3541.92) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 10 tps: 1812.01 qps: 36224.12 (r/w/o: 25355.09/7243.02/3626.01) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 291s ] thds: 10 tps: 1859.98 qps: 37183.67 (r/w/o: 26021.77/7441.93/3719.97) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 292s ] thds: 10 tps: 1905.80 qps: 38181.07 (r/w/o: 26736.25/7627.22/3817.61) lat (ms,95%): 7.98 err/s: 2.00 reconn/s: 0.00
[ 293s ] thds: 10 tps: 1742.18 qps: 34910.53 (r/w/o: 24445.47/6972.71/3492.35) lat (ms,95%): 8.43 err/s: 3.00 reconn/s: 0.00
[ 294s ] thds: 10 tps: 1606.96 qps: 32089.22 (r/w/o: 22450.45/6423.84/3214.92) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 10 tps: 1621.03 qps: 32479.61 (r/w/o: 22743.43/6487.12/3249.06) lat (ms,95%): 10.27 err/s: 2.00 reconn/s: 0.00
[ 296s ] thds: 10 tps: 1292.94 qps: 25896.89 (r/w/o: 18134.22/5173.78/2588.89) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 297s ] thds: 10 tps: 1408.06 qps: 28194.27 (r/w/o: 19740.89/5631.25/2822.13) lat (ms,95%): 10.65 err/s: 4.00 reconn/s: 0.00
[ 298s ] thds: 10 tps: 1840.00 qps: 36822.94 (r/w/o: 25769.95/7366.99/3685.99) lat (ms,95%): 8.43 err/s: 2.00 reconn/s: 0.00
[ 299s ] thds: 10 tps: 1867.03 qps: 37364.61 (r/w/o: 26160.43/7469.12/3735.06) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 300s ] thds: 10 tps: 1783.73 qps: 35691.60 (r/w/o: 24991.22/7129.92/3570.46) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            7576198
        write:                           2163739
        other:                           1082729
        total:                           10822666
    transactions:                        540921 (1802.94 per sec.)
    queries:                             10822666 (36073.00 per sec.)
    ignored errors:                      236    (0.79 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0190s
    total number of events:              540921

Latency (ms):
         min:                                    3.54
         avg:                                    5.54
         max:                                 1017.09
         95th percentile:                        8.43
         sum:                              2998997.91

Threads fairness:
    events (avg/stddev):           54092.1000/183.91
    execution time (avg/stddev):   299.8998/0.01